[
"Help: Flashcard App",
["Basic Editing",
    ["Add a Card",
        "Press the + button",
        "Add content to the card",
        "Press 'Done'"
    ],["Edit a Card",
        "Press and Hold on the Card until the card editor appears",
        "Edit the card content, then press done",
        "If having trouble recording sounds, check your device's privacy settings"
    ],["Delete a Card",
        "Tap the card once to select it. The border will turn orange",
        "Press the trash can button to delete all selected cards"
    ]
],
["Advanced Editing",
    ["Quick Create",
        "Quick Create allows you to create several cards at once from text. Images and sounds can be added later",
        "Press the 'pencil in a square' button in the top right toolbar",
        "On the first line, type the front of the first card",
        "On the second line, type the back of the first card",
        "On the third line, type the front of the second card",
        "On the fourth line, type the back of the second card",
        "...",
        "On the (2n-1)th line, type the front of the nth card",
        "On the (2n)th line, type the back of the nth card",
        "Press 'Create'"
    ],["Cut/Copy/Paste",
        "Open the document you want to copy cards from",
        "Select Cards to Cut/Copy",
        "Press the 'page and clipboard' button in the bottom toolbar",
        "Select Cut or Copy to copy the selected cards",
        "Open the docment you want to paste the cards into",
        "Press the 'page and clipboard' button in the bottom toolbar",
        "Select Paste"
    ],["Undo/Redo",
        "Press the 'left arrow' button in the bottom toolbar",
        "If there are no changes to redo, undo will happen automatically",
        "If there a redo is possible, select undo or redo",
        "NOTE: Shake to undo is not supported in the current version"
    ]
],
["",
    ["Studying",
    "Select the cards you want to study. If no cards are selected, the entire set will be used",
    "Press 'Study'",
    "When presented with the first side of a card, press 'Flip Over' to view the other side",
    "Alternatively, press 'Skip Card' to view a different card",
    "If you feel confident with a card, press 'Remove Card' to remove it (this won't delete the card from your document)",
    "If you don't feel confident with a card, press 'Keep Card' to keep it in the rotation",
    "Cards are shuffled automatically",
    "Press 'Done' to finish studying"
    ]
]
]
